app/views/pins/_form.html.erb

    <%= f.label :board_id %><br>
    <%= f.collection_select(:board_id, Board.all, :id, :name) %>
---
SELECT "boards".* FROM "boards"