app/views/pins/show.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 4  ORDER BY "users"."id" ASC LIMIT 1
---
  <strong>User:</strong>
  <%= @pin.user.first_name rescue "N/A" %>