app/views/boards/index.html.erb

        <h4><%= board.about %></h4>
        <h4> Board Creator: <%= board.user.first_name rescue "N/A" %></h4>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 4  ORDER BY "users"."id" ASC LIMIT 1