app/views/boards/show.html.erb

  <strong>Created by:</strong>
  <%= @board.user.first_name rescue "N/A" %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 4  ORDER BY "users"."id" ASC LIMIT 1

 <div id="columns">
  <% @board.pins.each do |pin| %>
---
SELECT "pins".* FROM "pins"  WHERE "pins"."board_id" = ?  [["board_id", 1]]