app/controllers/boards_controller.rb

DELETE FROM "boards"
---
  def delete_all
    Board.delete_all

SELECT "pins".* FROM "pins"  WHERE "pins"."board_id" = ?  [["board_id", 1]]
---
  def show
    @users = User.all
    @pins = Pin.all

INSERT INTO "boards" ("about", "created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["about", "This is my first board."], ["created_at", "2014-08-05 13:15:22.881221"], ["name", "Firt Board"], ["updated_at", "2014-08-05 13:15:22.881221"], ["user_id", 1]]
---
  def create
    @board = Board.new(board_params)
    @board.user = current_user

    respond_to do |format|
      if @board.save

UPDATE "boards" SET "name" = ?, "updated_at" = ? WHERE "boards"."id" = 1  [["name", "First Board"], ["updated_at", "2014-08-05 14:38:44.006575"]]
---
  def update
    respond_to do |format|
      if @board.update(board_params)