app/controllers/pins_controller.rb

  def create
    @pin = Pin.new(pin_params)
    @pin.user = current_user

    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("board_id", "created_at", "image", "name", "nsfw", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["board_id", 1], ["created_at", "2014-08-20 01:57:41.749053"], ["image", "IMG_0831.JPG"], ["name", "secret crush"], ["nsfw", "t"], ["updated_at", "2014-08-20 01:57:41.749053"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @pin.update(pin_params)
---
UPDATE "pins" SET "image" = ?, "updated_at" = ? WHERE "pins"."id" = 8  [["image", "IMG_0831.JPG"], ["updated_at", "2014-08-19 19:26:58.330684"]]