app/controllers/static_pages_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 12  ORDER BY "users"."id" ASC LIMIT 1
---
  def edit_user
  	@user = User.find(params[:id])