app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.all

    if @users.count > 5

SELECT "boards".* FROM "boards"  WHERE "boards"."user_id" = ?  [["user_id", 1]]
---
  def show
    @boards = @user.boards

    if @user.first_name == "Jessica"

INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-08-06 13:26:00.724596"], ["email", "sara@email.com"], ["first_name", "Sara"], ["last_name", "Elizabeth"], ["updated_at", "2014-08-06 13:26:00.724596"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["first_name", "Charlie"], ["last_name", "Omega"], ["updated_at", "2014-08-19 13:08:57.013176"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)